Repository: LukaszLejman/PJN
Catalog: manuals/1/align_2017.12.08_13.27.55/RS800CX-HRRS800CX.tmx
Source language: en
Languages: hr

source: Batteries should be properly disposed of according to local regulations. Changing Polar H1/H2/H3 Heart Rate Sensor Battery
hr: Prije zatvaranja poklopca baterije, provjerite da prsten za brtvljenje nije oštećen i da je pravilno postavljen u svoj utor.

source: A non-metal tool is preferable.
hr: INFORMACIJE SLUŽBE ZA KORISNIKE

source: Customer Service Information 61
hr: 61 HRVATSKI, SRPSKI

source: ENGLISH on the connector and press the battery cover back into place. You should hear a snap.
hr: 5. Vratite poklopac baterije na njegovo mjesto i s kovanicom ga okrenite u smjeru kazaljke na satu u zatvoreni (CLOSE) položaj.

source: Changing Polar WearLink+ Heart Rate Sensor Battery
hr: Provjerite da je poklopac dobro zatvoren!

source: 1. Using a coin, open the battery cover by turning it counterclockwise to OPEN.
hr: Pretjerana uporaba pozadinskog osvjetljenja monitora srčane frekvencije brže troši bateriju.

source: 2. Insert the battery inside the cover with the negative (-) side outwards.
hr: U hladnim uvjetima, može se pojaviti indikator prazne baterije i ponovo nestati kada se vratite u topliju okolinu.

source: Make sure the sealing ring is in the groove to ensure water resistance.
hr: Kako bi osigurali maksimalni radni vijek poklopca baterije, otvarajte ga samo prilikom zamjene baterije.

source: 3. Press the cover back into the connector. 4. Use the coin to turn the cover clockwise to CLOSE.
hr: Prilikom zamjene baterije, provjerite da prsten za brtvljenje nije oštećen, te ga u tom slučaju trebate zamijeniti s novim.

source: Danger of explosion if the battery is replaced with wrong type.
hr: Setovi baterija s prstenima za brtvljenje su dostupni u dobro opremljenim Polar prodavaonicama i ovlaštenim Polar servisnim centrima.

source: Precautions Interference During Exercise Electromagnetic Interference and Exercise Equipment
hr: U SAD i Kanadi, prsteni za brtvljenje su dostupni samo u ovlaštenim Polar servisnim centrima. Baterije držite dalje od djece.

source: Disturbance may occur near microware ovens and computers.
hr: Ako se baterija proguta, odmah kontaktirajte liječnika.

source: Also WLAN base stations may cause interference when exercising with RS800CX.
hr: Baterije se trebaju pravilno odložiti u skladu s lokalnim propisima.

source: To avoid erratic reading or misbehaviors, move away from possible sources of disturbance.
hr: Kako bi izbjegli kriva očitanja, maknite se dalje od mogućih izvora smetnji.

source: Exercise equipment with electronic or electrical components such as LED displays, motors and electrical brakes may cause interfering stray signals.
hr: Oprema za vježbanje s elektronskim ili električkim komponentama, kao što su LED zasloni, motori i električke kočnice mogu uzrokovati smetnje.

source: 1. Remove the heart rate sensor from your chest and use the exercise equipment as you would normally.
hr: Za rješavanje ovih problema, pokušajte slijedeće: 1.

source: 2. Move the training computer around until you find an area in which it displays no stray reading or does not flash the heart symbol.
hr: 2. Uklonite primopredajnik s vaših prsa i normalno koristite opremu za vježbanje.

source: Interference is often worst directly in front of the display panel of the equipment, while the left or right side of the display is relatively free of disturbance.
hr: Vozite se uokolo sa monitorom srčane frekvencije dok ne nađete mjesto na kojem ne prikazuje kriva očitanja ili ne trepće simbol srca.

source: 3. Put the heart rate sensor back on your chest and keep the training computer in this interference-free area as much as possible.
hr: Smetnje su obično najveće direktno ispred zaslona opreme, dok su lijeva i desna strna relativno slobodne od smetnji.

source: If the training computer still does not work with the exercise equipment, it may be electrically too noisy for wireless heart rate measurement.
hr: 3. Vratite primopredajnik na vaša prsa i držite monitor srčane frekvencije u ovom području bez smetnji što je duže moguće.

source: The training computer is water resistant. However, heart rate measurement does not work in water. You can use the training computer under water as a watch but it is not a diving instrument.
hr: 3. Ako monitor srčane frekvencije i dalje ne radi s ovom opremom za vježbanje, u okolini ima previše električkih smetnji za bežično mjerenje otkucaja srca.

source: To maintain water resistance, do not press the buttons of the training computer under water.
hr: Uporaba RS800 monitora srčane frekvencije u vodi Ovaj monitor srčane frekvencije je otporan na vodu.

source: Minimizing Risks When Exercising Exercise may include some risk.
hr: Međutim, mjerenje otkucaja srca ne radi u vodi.

source: 62 Customer Service Information
hr: 62 INFORMACIJE SLUŽBE ZA KORISNIKE

source: • Do you use a pacemaker or other implanted electronic device? • Do you smoke? • Are you pregnant?
hr: Možete koristiti monitor srčane frekvencije pod vodom kao sat ali to nije instrument za ronjenje.

source: Note that in addition to exercise intensity, medications for heart conditions, blood pressure, psychological conditions, asthma, breathing, etc., as well as some energy drinks, alcohol, and nicotine may also affect heart rate.
hr: Kako bi zadržali otpornost na vodu, ne pritišćite tipke monitora srčane frekvencije pod vodom. Uporaba monitora srčane frekvencije pri jakoj kiši također može uzokovati smetnje.

source: It is important to be sensitive to your body’s responses during exercise.
hr: Minimiziranje rizika prilikom vježbanja Vježbanje može uključivati neke rizike.

source: If you feel unexpected pain or excessive fatigue when exercising, it is recommended that you stop the exercise or continue at a lighter intensity.
hr: Prije početka redovitog programa vježbanja, preporuča se da odgovorite na slijedeća pitanja u svezi vašeg zdravlja.

source: Note!
hr: Uzmite u obzir da uz intenzitet vježbanja, lijekovi za srce, krvni tlak, psihološke probleme, astmu, disanje, itd., i neka energetska pića, alkohol i nikotin također mogu utjecati na otkucaje srca.

source: If you are using a pacemaker, you can use Polar training computers.
hr: Važno je za vrijeme vježbanja osluškivati svoje tijelo.

source: In theory interference to pacemaker caused by Polar products should not be possible.
hr: Naputak za osobe s pacemakerom, defibrilatorima ili drugim ugrađenim elektronskim uređajima.

source: In practice no reports exist to suggest anyone ever having experienced interference.
hr: Osobe koje imaju ugrađeni pacemaker mogu koristiti Polar monitor srčane frekvencije na vlastitu odgovornost.

source: We cannot however issue an official guarantee on our products' suitability with all pacemakers or other implanted devices due to the variety of devices available.
hr: Prije početka uporabe, preporučamo provođenje testa maksimalnog naprezanja pod nadzorom liječnika.

source: If you have any doubts, or if you experience any unusual sensations while using Polar products, please consult your physician or contact the implanted electronic device manufacturer to determine safety in your case.
hr: Test se provodi radi provjere sigurne i pouzdane istovremene uporabe pacemakera i Polar monitora srčane frekvencije.

source: If you are allergic to any substance that comes into contact with your skin or if you suspect an allergic reaction due to using the product, check the listed materials in Technical Specifications.
hr: Ako ste alergični na bilo kakvu supstanciju koja dođe u kontakt s vašom kožom ili sumnjate na alergijsku reakciju zbog uporabe ovog proizvoda, provjerite dane materijale u Tehničkim specifikacijama.

source: To avoid any skin reaction to the heart rate sensor, wear it over a shirt, but moisten the shirt well under the electrodes to ensure flawless operation.
hr: Kako bi izbjegli reakciju kože na primopredajnik, nosite ga preko majice, ali dobro navlažite majicu ispod elektroda kako bi osigurali siguran rad.

source: Your safety is important to us.
hr: Vaša sigurnost za nas je jako važna.

source: The shape of the s3/s3+ stride sensor* is designed to minimize the possibility of it getting caught in something.
hr: Oblik trkaćeg senzora/senzora brzine je tako dizajniran da minimizira rizik da zapne za nešto.

source: In any case, be careful when running with the stride sensor in brushwood, for example.
hr: U svakom slučaju budite oprezni prilikom trčanja s trkaćim senzorom/senzorom trčanja kroz šipražje.

source: The combined impact of moisture and intense abrasion may cause a black color to come off the heart rate sensor’s surface, possibly staining light-colored clothes.
hr: Kombinirani dodir vlage i jakog trenja može uzrokovati pojavu crne boje na površini primopredajnika, što može ostaviti mrlju na svijetloj odjeći.

source: If you use insect repellent on your skin, you must ensure that it does not come into contact with the heart rate sensor. *Optional s3/s3+ stride sensor W.I.N.D. required.
hr: Ako na koži koristite zaštitno sredstvo protiv insekata, pazite da to sredstvo ne dođe u kontakt s primopredajnikom. *s3 senzor brzine W.I.N.D. je potreban

source: Technical Specifications Training computer Battery life: Average 1 year (1h/day, 7 days/week) Battery type: CR2032 Battery sealing ring: O-Ring 20.0 x 1.1, material silicone Operating temperature: -10 °C to +50 °C / 14 °F to 122 °F Wrist band and buckle material: Polyurethane, stainless steel Back cover: Polyamide, stainless steel complying with the EU Directive 94/27/EU and its amendment 1999/C 205/05 on the release of nickel from products intended to come into direct and prolonged contact with the skin. Watch accuracy: Better than ± 0.5 seconds / day at 25 °C / 77 °F temperature. Accuracy of heart rate monitor: ± 1% or 1 bpm, whichever larger. Definition applies to stable conditions.
hr: Tehničke specifikacije Monitor srčane frekvencije Uređaj spada u klasu 1 laserskih proizvoda Trajnost baterije: Vrsta baterije: Prsten za brtvljenje baterije: Radna temperatura: Materijal ručnog pojasa i kopče: Stražnji poklopac: Točnost sata: Prosječno 1 godina (1h/dan, 7 dana/tjedno) CR2032 O-prsten 20.0 x 1.1, silikon -10°C do +50°C Poliuretan, nehrđajući čelik Poliamid, nehrđajući čelik koji zadovoljava EU Direktivu 94/27/EU i nadopune 1999/C 205/05 o ispuštanju nikla iz proizvoda namijenjenih da dođu u direktni i produženi kontakt s kožom Bolja od ±0,5 sekundi/dan pri 25°C

source: Ascent/Descent resolution: 5 m / 20 ft
hr: INFORMACIJE SLUŽBE ZA KORISNIKE

source: Customer Service Information 63
hr: 63 HRVATSKI, SRPSKI

source: Total distance: 999 999 km / 621370 mi Total duration: 9999h 59min 59s Total calories: 999 999 kcal Total exercise count: 9999 Total ascent: 304795 m / 999980 ft Total odometer: 999 999 km / 621370 mi
hr: Granične vrijednosti monitora srčane frekvencije Maksimalni broj datoteka: Maksimalno vrijeme: Maksimalni broj ručnih krugova: Maksimalni broj automatskih krugova: Cipele 1/2/3 ukupna udaljenost: Bicikl 1/2/3 ukupna udaljenost: Ukupna udaljenost cipele/GPS/bicikli: Ukupna udaljenost: Ukupno trajanje: Ukupno kalorija: Ukupni broj vježbi: Ukupni uspon: Ukupno odometar: 99 99 h 59 min 59 s 99 99 999 999 km / 621370 mi 999 999 km / 621370 mi 999 999 km / 621370 mi 999 999 km / 621370 mi 9999h 59min 59s 999 999 kcal 9999 304795 m / 999980 ft 999 999 km / 621370 mi

source: Heart rate sensor Battery life: 1600 h Battery type: CR2025 Battery sealing ring: O-ring 20.0 x 0.90 Material Silicone Operating temperature: -10 °C to +40 °C / 14 °F to 104 °F Connector material: Polyamide Strap material: 38% Polyamide, 29% Polyurethane, 20% Elastane, 13% Polyester
hr: Primopredajnik Trajnost baterije WearLink W.I.N.D. uređaja: Vrsta baterije: Prsten za brtvljenje baterije: Radna temperatura: Materijal priključka: Materijal trake: Polar ProTrainer 5™ Zahtjevi sustava: PC Windows® 2000/XP (32bit), Vista IrDA kompatibilni port (vanjski IrDA uređaj ili unutrašnji IR port).

source: Polar ProTrainer 5™ System Requirements: PC Windows® 2000/XP (32bit), Vista IrDA compatible port (an external IrDA device or an internal IR port) Additionally, for the software your PC must have a Pentium II 200 MHz processor or faster, SVGA or higher resolution monitor, 50 MB hard disk space and a CD-ROM drive.
hr: Dodatno uz softver vaše računalo mora imati Pentium II 200 MHz procesor ili brži, SVGA ili monitor veće rezolucije, 50 MB prostora na tvrdom disku i CD-ROM uređaj.

source: Polar WebLink using IrDA Communication System Requirements: PC Windows® 2000/XP, Vista 32/64-bit or Windows 7 32/64-bit IrDA compatible port (an external IrDA device or an internal IR port) The Polar training computer is designed to indicate the level of physiological strain and recovery during and after exercise session.
hr: Prosječno 2 godine (3h/dan, 7 dana/tjedan) CR2025 O-prsten 20.0 x 1.0, silikon -10°C do +40°C poliamid poliuretan/poliamid/ poliester/elastan/najlon Polar WebLink koristeći IrDA komunikaciju Zahtjevi sustava: PC Windows® 98/98SE/ME/2000/XP IrDA kompatibilni port (vanjski IrDA uređaj ili unutrašnji IR port).

source: It displays performance indicators and environmental conditions such as altitude and temperature.
hr: Polar monitor srčane frekvencije prikazuje razinu fiziološkog napora i intenziteta za vrijeme vježbanja.

source: It also measures speed and distance when used with s3/s3+ stride sensor/cycling speed sensor/G3/G5 GPS sensor, running cadence when used with s3/s3+ stride sensor, cycling cadence when used with a cadence sensor, and location data when used with a G3/G5 GPS sensor.
hr: Prikazuje i vremenske uvjete kao što su temperatura i nadmorska visina. Također mjeri brzinu i udaljenost prilikom vožnje s Polar trkaćim s3 senzorom brzine/G3 GPS senzorom, ritam trčanja pomoću s3 senzora, ritam bicikliranja sa senzorom ritma i podatke o lokaciji pomoću G3 GPS senzora.

source: No other use is intended or implied.
hr: Uređaji nisu namijenjeni niti za jednu drugu uporabu.

source: The Polar training computer should not be used for obtaining environmental measurements that require professional or industrial precision.
hr: Polar monitor srčane frekvencije se ne bi trebao koristiti za mjerenja okoline, koja zahtijevaju profesionalnu ili industrijsku preciznost.

source: Furthermore, the device should not be used to obtain measurements when engaged in airborne or underwater activities.
hr: Nadalje, uređaj se ne bi trebao koristiti za dobivanje mjerenja tijekom zračnih i podvodnih aktivnosti.

source: The water resistance of Polar products is tested according to International Standard ISO 2281.
hr: Otpornost na vodu Polar proizvoda je testirana u skladu s međunarodnim standardom ISO 2281.

source: Products are divided into three different categories according to their water resistance.
hr: Proizvodi su podijeljeni u tri različite kategorije prema otpornosti na vodu.

source: Check the back of your Polar product for the water resistance category, and compare it to the chart below.
hr: Provjerite stražnju stranu vašeg Polar proizvoda radi kategorije otpornosti na vodu i usporedite je s donjom tablicom.

source: Please note that these definitions do not necessarily apply to products of other manufacturers.
hr: Molimo vas da uzmete u obzir da ove definicije ne moraju vrijediti za proizvode drugih proizvođača.

source: Marking on case back Water resistant characteristics Water resistant Protected against wash splashes, sweat, raindrops etc.
hr: Oznaka na stražnjoj strani kućišta Otporan na vodu (Water resistant) Otporan na vodu 30m/50m (water resistant 30m/50m) Otporan na vodu 100m (Water resistant 100m) Karakteristike otpornosti na vodu Prskanje, kapljice kiše, itd.

source: Not suitable for swimming.
hr: Minimum za kupanje i plivanje.

source: Frequently Asked Questions What should I do if...
hr: Za čestu uporabu u vodi, ali bez spremnika za zrak

source: When the symbol appears, the training computer sounds and backlight are automatically deactivated.
hr: *Ove karakteristike se također odnose na Polar WearLink 31 i Polar WearLink W.I.N.D. primopredajnik,

source: 64 Customer Service Information
hr: 64 INFORMACIJE SLUŽBE ZA KORISNIKE

source: ...there are no reactions to any buttons?
hr: označen s "Water resistant 30 m".

source: Reset the training computer by pressing all the buttons simultaneously for two seconds until the display fills with digits.
hr: Često postavljana pitanja Što da napravim ako… …ako je prikazan simbol baterije i poruka Battery low ?

source: Press any button and set the time and date in Basic Settings after the reset.
hr: Indikator prazne baterije je obično prvi znak prazne baterije.

source: All other settings are saved.
hr: Međutim, u hladnim uvjetima se može pojaviti indikator prazne baterije.

source: Skip the rest of the settings by pressing and holding STOP.
hr: Indikator će se ugasiti čim se vratite u okolinu s normalnom temperaturom.

source: ...the heart rate reading becomes erratic, extremely high or shows nil (00)? • Make sure the heart rate sensor strap has not loosened during exercise. • Make sure the textile electrodes in the sports apparel fit snugly. • Make sure that the electrodes of the heart rate sensor / sports apparel are moistened. • Make sure the heart rate sensor / sports apparel is clean. • Strong electromagnetic signals can cause erratic readings.
hr: Pritisnite bilo koju tipku i postavite vrijeme i datum, i ostatak postavki se spremi. Preskočite ostatak postavki pritiskom i držanjem tipke STOP. …očitanje otkucaja srca postane nepravilno, ekstremno visoko ili niša ne pokazuje (00)? • Provjerite da monitor srčane frekvencije nije dalje od 1 m od primopredajnika. • Provjerite da se za vrijeme vježbanja pojas primopredajnika nije olabavio. • Provjerite da tekstilne elektrode u sportskoj odjeći dobro naliježu. • Provjerite jesu li elektrode primopredajnika/sportske odjeće navlažene. • Provjerite je li primopredajnik/sportska odjeća čista. • Provjerite da unutar 1 m nema drugog primopredajnika otkucaja srca. • Snažni elektromagnetski signali mogu uzrokovati nepravilna očitanja.

source: For further information, see Precautions (page 62). • If the erratic heart rate reading continues despite moving away from the source of disturbance, slow down your speed and check your pulse manually.
hr: Za dodatne informacije pogledajte Mjere opreza (stranica 62). • Ako se nepravilna očitanja otkucaja srca nastave unatoč činjenici da ste se odmaknuli od izvora smetnji, smanjite brzinu i ručno provjerite svoj puls.

source: If you feel it corresponds to the high reading on the display, you may be experiencing cardiac arrhythmia.
hr: Ako osjećate da odgovara visokom očitanju na zaslonu, možda prolazite kroz stanje srčane aritmije.

source: Most cases of arrhythmia are not serious, but consult your doctor nevertheless. • A cardiac event may have altered your ECG waveform.
hr: Većina slučajeva aritmije nisu ozbiljni, ali bez obzira posjetite liječnika. • Srčani događaj je možda promijenio vaš ECG valni oblik.

source: In this case, consult your physician. …Memory full is displayed?
hr: U tom slučaju, posavjetujte se s liječnikom. …se prikaže Memory full ?

source: The message appears during exercise if you have recorded 99 laps or if no memory space is left for the exercise.
hr: Ova poruka se pojavi tijekom vježbanja ako ste snimili 99 krugova ili ako za vježbu nije ostalo mjesta u memoriji.

source: In that case, stop recording the exercise and transfer the exercise files from your training computer to the Polar ProTrainer 5. Then delete them from the training computer.
hr: Za oslobađanje mjesta u memoriji, prebacite podatke o vježbanju u Polar ProTrainer 5 softver, te obrišite podatke iz memorije monitora srčane frekvencije. …se prikaže Check WearLink!

source: …Check WearLink! is displayed and your training computer cannot find your heart rate signal? • Make sure the heart rate sensor strap has not loosened during exercise. • Make sure the textile electrodes in sports apparel fit snugly. • Make sure that the electrodes of the heart rate sensor / sports apparel are moistened. • Make sure the heart rate sensor / electrodes in the sports apparel are clean and undamaged. • If the heart rate measurement does not work with the sports apparel, try using a heart rate sensor strap.
hr: I vaš monitor srčane frekvencije ne može očitati signal otkucaja srca? • Provjerite da monitor srčane frekvencije nije dalje od 1 m od primopredajnika. • Provjerite da se za vrijeme vježbanja pojas primopredajnika nije olabavio. • Provjerite da tekstilne elektrode u sportskoj odjeći dobro naliježu. • Provjerite jesu li elektrode primopredajnika/sportske odjeće navlažene. • Provjerite jesu li primopredajnik/elektrode u sportskoj odjeći čisti i neoštećeni. • Ako mjerenje otkucaja srca ne radi sa sportskom odjećom, pokušajte koristiti WearLink pojas.

source: If your heart rate is detected with the strap, the problem is most probably in the apparel.
hr: Ako monitor srčane frekvencije detektira otkucaje srca s pojasom, onda je problem vjerojatno u sportskoj odjeći.

source: Please contact the apparel retailer / manufacturer. • If you have done all of the above-mentioned actions, and the message still appears and heart rate measurement does not work, the battery of your heart rate sensor may be empty.
hr: Molimo vas kontaktirajte proizvođača/prodavača odjeće. • • Ako ste proveli sve iznad navedene opcije i poruka se i dalje pojavljuje i mjerenje otkucaja srca ne radi, baterija vašeg primopredajnika je možda prazna.

source: For further information, see Care and Maintenance (page 60).
hr: INFORMACIJE SLUŽBE ZA KORISNIKE 65 HRVATSKI, SRPSKI

source: …New WearLink found.
hr: …se prikaže New WearLink found.

source: Teach new WearLink? is displayed?
hr: Teach new WearLink? ?

source: If you have purchased a new heart rate sensor as an accessory, it will have to be introduced to the training computer.
hr: Ako ste novi primopredajnik kupili kao dodatnu opremu, treba se uvesti u monitor srčane frekvencije.

source: For further information, see Teach a New Heart Rate Sensor (page ).
hr: Za dodatne informacije pogledajte Uvođenje novog primopredajnika (stranica ).

source: If the heart rate sensor you are using is included in the product set, and the text appears on the display, the training computer may be detecting the signal of another heart rate sensor.
hr: Ako je primopredajnik koji koristite došao u paketu sa monitorom srčane frekvencije i na zaslonu se prikaže ovaj tekst, monitor srčane frekvencije možda detektira signal s drugog primopredajnika.

source: In that case, make sure you are wearing your own heart rate sensor, that the electrodes are moistened, and that the heart rate sensor strap has not loosened.
hr: U tom slučaju, provjerite da nosite vaš primopredajnik, da su elektrode vlažne i da se pojas primopredajnika nije olabavio.

source: If the message still appears, the battery of your heart rate sensor is empty.
hr: Ako se poruka još uvijek pojavljuje, baterija vašeg primopredajnika je prazna.

source: For further information, see Care and Maintenance (page 60). ...S sensor calibration failed is displayed?*
hr: Za dodatne informacije pogledajte Briga i održavanje (stranica 61). …se prikaže S sensor calibration failed ?* Kalibracija nije uspjela i morate ponoviti.

source: Calibration did not succeed and you need to re-calibrate.
hr: Kalibracija neće uspjeti ako se pomičete za vrijeme mjerenja.

source: Calibration fails if you move during the process. Once you reach lap distance, stop running and stand still for calibration.
hr: Kada dostignete dužinu kruga, prestanite trčati i stanite na mjestu za kalibriranje.

source: The range of the calibration factor during manual calibration is 0.500-1.500.
hr: Raspon kalibracijskog faktora ručne kalibracije je između 0,500 i 1,500.
